Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/types_of_employment/agency_workers.html.txt.tmx
Source language: en
Languages: ga

source: • Protection of Employees (Temporary Agency Work) Act 2012
ga: • Acht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012

source: An agency worker is a person who has an agreement with an agency to work for another person
ga: Is éard atá in oibrí gníomhaireachta ná duine a bhfuil comhaontú aige/aici le gníomhaireacht chun do dhuine eile

source: For example, a secretary may have an agreement with a secretarial agency to do work for an office while one of their employees is on leave
ga: Mar shampla, d’fhéadfadh comhaontú a bheith ag rúnaí le gníomhaireacht rúnaíochta chun obair a dhéanamh d’oifig chomh fada is atá duine dá bhfostaithe ar saoire

source: While agency workers do not have all the same employment rights as regular workers, under the EU Directive on Temporary Agency Work (see below) temporary agency workers have the right to equal treatment in basic working and employment conditions
ga: Cé nach bhfuil na cearta fostaíochta céanna ag oibrithe gníomhaireachta agus atá ag gnáthoibrithe, faoin Treoir AE um Obair Ghníomhaireachta Shealadach (féach thíos) tá siad i dteideal caitheamh cothrom i gcoinníollacha oibre agus fostaíochta

source: This Directive was transposed into Irish legislation by the Protection of Employees (Temporary Agency Work) Act 2012 (see below)
ga: Trasuíonn an tAcht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012 (pdf) an Treoir i ndlí na hÉireann

source: Agency workers are also protected under other employment legislation see ‘Other legislation’ below
ga: Tá cearta áirithe ag oibrithe gníomhaireachta faoin reachtaíocht fostaíochta eile - féach 'Reachtaíocht fostaíochta eile' thíos

source: EU Directive on Temporary Agency Work
ga: Treoir AE um Obair Gníomhaireachta Shealadach

source: The EU Directive on Temporary Agency Work 2008/104/EC (pdf) came into effect on 5 December 2011
ga: Tháinig an Treoir AE um Obair Gníomhaireachta Shealadach 2008/104/EC (pdf) i bhfeidhm an 5 Nollaig 2011

source: It provides that all temporary agency workers must have equal treatment with regular workers from their first day at work in respect of:
ga: Soláthraionn sé nach mór caitheamh le hoibrithe gníomhaireacht mar an gcéanna le gnáthoibrithe i leith óna gcéad lá ag an obair:

source: • The duration of working time, rest periods, night work, annual leave and public holidays
ga: • Fad am oibre, sosanna, obair oíche, saoire bhliantúil agus saoirí poiblí

source: • Work done by pregnant women and nursing mothers, children and young people
ga: • Obair á déanamh ag mná atá ag iompar clainne agus ag máithreacha atá ag beathú leanaí, ag leanaí agus ag daoine óga

source: • Action taken to combat discrimination on the grounds of sex, race or ethnic origin, religion or beliefs, disabilities, age or sexual orientation
ga: • Gníomhú chun cur i gcoinne idirdhealaithe mar gheall ar inscne, cine, bunús eitneach, reiligiún, míchumais, aois nó claonadh gnéasach

source: Temporary agency workers must also have equal access to facilities such as childcare and must be informed of permanent employment opportunities
ga: Ní mór an rochtain chéanna a bheith ag oibrithe gníomhaireachta sealadacha ar áiseanna cosúil le cúram leanaí agus ní mór iad a chur ar an eolas maidir le deiseanna fostaíochta buana

source: Protection of Employees (Temporary Agency Work) Act 2012
ga: Acht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012

source: The Protection of Employees (Temporary Agency Work) Act 2012 transposing this EU Directive into Irish legislation was signed into law on 16 May 2012
ga: Trasuíonn an tAcht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012 an Treoir i ndlí na hÉireann agus tháinig sé i bhfeidhm an 16 Bealtaine 2012

source: It provides that all temporary agency workers must have equal treatment as if they had been directly recruited by the hirer from their first day at work
ga: Soláthraíonn sé caitheamh mar an gcéanna le hoibrithe gníomhaireachta sealadacha óna gcéad lá oibre mar a bhfostaítear ag an bhfruilitheoir go díreach

source: Who is covered by this Act?
ga: Cé atá clúdaithe ag an Acht seo?

source: The Act applies to agency workers employed by an employment agency who are temporarily assigned to work for, and under the supervision and direction of, another organisation (the hirer)
ga: Baineann an tAcht le hoibrithe gníomhaireachta atá fostaithe ag gníomhaireacht fostaíochta atá sannta go sealadach le hoibriú d’eagraíocht eile, agus atá faoi mhaoirsiú agus stiúir eagraíocht eile (an fostóir)

source: Who is not covered by the Act?
ga: Cé nach bhfuil clúdaithe ag an Acht seo?

source: The Act does not cover employees of contractor companies and limited liability companies where the worker is the beneficial owner
ga: Ní chlúdaíonn an tAcht fostaithe cuideachtaí conraitheora agus cuideachtaí dliteanais theoranta sa chás gurb é an t-oibrí an t-úinéir tairbhiúil

source: The Act may also exclude those employed under a managed service contract, which is a contract for services, for example, cleaning, where the contractor is responsible for managing and delivering the service
ga: D’fhéadfadh an tAcht, chomh maith leis sin, iad siúd atá fostaithe faoi chonradh seirbhíse bainistithe a eisiamh, ar conradh le haghaidh seirbhísí atá i gceist leis seo, mar shampla, glantachán, sa chás go bhfuil an conraitheoir freagrach as an tseirbhís a bhainistiú agus a sheachadadh

source: The Act does not apply to work done on the Work Placement Scheme, JobBridge or any publicly-funded vocational training or re-training scheme specified by the Minister for Jobs, Enterprise and Innovation
ga: Ní bhaineann an tAcht le hobair a rinneadh ar Scéim Socrúchán Oibre, JobBridge nó ar aon scéim gairmoiliúna nó athoiliúna atá faoi chistiú poiblí a shonraíonn an tAire Post, Fiontar agus Nuálaíochta

source: Employment and working conditions
ga: Coinníollacha fostaíochta agus oibre

source: Since 16 May 2012 temporary agency workers covered by the Act have the right to the same basic employment conditions as if they had been directly employed by the hirer under a contract of employment
ga: Ón 16 Bealtaine 2012 i leith, tá sé de cheart ag oibrithe sealadacha gníomhaireachta atá clúdaithe ag an Acht, na coinníollacha céanna bunúsacha fostaíochta a bheith acu agus a bheadh acu dá ndéanfadh an fostóir iad a fhostú go díreach faoi chonradh fostaíochta

source: The right to equal pay has retrospective effect to 5 December 2011
ga: Tá tionchar siarghabhálach ag an gceart i leith comhphá a fhad siar leis an 5 Nollaig 2011

source: These employment and working conditions are as follows:
ga: Is mar seo a leanas iad na coinníollacha fostaíochta agus oibre seo:

source: This includes the duration of working time, rest periods, breaks, night work, annual leave and public holidays
ga: Áirítear leis seo fad an ama oibre, tréimhsí sosa, sosanna, obair istoíche, saoire bhliantúil agus saoirí poiblí

source: This is defined as basic pay, shift premium, piece work, overtime, unsocial hours worked, and Sunday work
ga: Is é an sainmhíniú a thugtar air seo pá bunúsach, bónas seala, ragobair, uaireanta neamhshóisialta a oibríodh, agus obair ar an Domhnach

source: The definition of pay in the Act does not include occupational pension schemes, sick pay, bonuses, maternity pay or benefit in kind
ga: Ní áirítear leis an sainmhíniu ar phá san Acht gairmscéimeanna pinsin, pá breoiteachta, bónais, pá máithreachais nó sochar comhchineáil

source: The right to equal pay is backdated to 5 December 2011
ga: Gabhann an ceart i leith comhphá siar a fhad leis an 5 Nollaig 2011

source: Derogation: If the agency worker has a permanent contract with the agency and is paid between assignments, equal treatment as regards pay does not apply
ga: Maolú: Má tá conradh buan ag an oibreoir gníomhaireachta leis an ngníomhaireacht agus má íoctar idir tascanna é/í, ní chaithfear leo mar an gcéanna maidir le cúrsaí pá

source: Access to facilities: Temporary agency workers must have equal access to facilities such as childcare, canteen and car parking
ga: Rochtain ar áiseanna: Ní mór go mbeidh ag oibrithe sealadacha gníomhaireachta comhrochtain ar áiseanna ar nós cúram leanaí, ceaintín agus carrpháirceáil

source: They also must have equal access to information about permanent employment opportunities
ga: Ina theannta sin, ní mór go mbeadh acu comhrochtain ar fhaisnéis faoi dheiseanna buanfhostaíochta

source: The Department of Jobs, Enterprise and Innovation has published guidance on the Protection of Employees (Temporary Agency Work) Act 2012 (pdf)
ga: D’fhoilsigh an Roinn Post, Fiontar agus Nuálaíochta treoir faoin Acht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012 (pdf)

source: An agency worker is protected against being victimised for reporting breaches of the Protection of Employees (Temporary Agency Work) Act 2012
ga: Má thugann oibrí gníomhaireachta sáruithe ar an Acht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012, tugtar cosaint do/di i gcoinne íospartha

source: This means that the hirer or the agency may not penalise an agency worker by dismissal, unfair treatment or an unfavourable change in their conditions of employment
ga: Ciallaíonn sé nach féidir le fruilitheoir nó gníomhaireacht pionós a chur ar oibrí gníomhaireachta trí dhífhostú, caitheamh leat go míchothrom, nó athrú neamhfhabhrach a dhéanamh ar do choinníollacha fostaíochta

source: Agency workers also have certain rights under the following employment legislation:
ga: Tá cearta áirithe ag oibrithe gníomhaireachta faoin reachtaíocht fostaíochta seo a leanas:

source: • Unfair Dismissals Acts 1977–2007
ga: • Na hAchtanna um Dhífhostú Éagórach 1977–2007

source: • Redundancy Payments Acts 1967–2014
ga: • Na hAchtanna um Íocaíochtaí Iomarcaíochta 1967–2014

source: • Minimum Notice and Terms of Employment Acts 1973–2005
ga: • Na hAchtanna um Fhógra Íosta agus Téarmaí Fostaíochta 1973–2005

source: • Organisation of Working Time Act 1997
ga: • An tAcht um Eagrú Ama Oibre 1997

source: • Payment of Wages Act 1991
ga: • An tAcht um Íoc Pá 1991

source: • Maternity Protection Acts 1994 and 2004
ga: • Na hAchtanna um Chosaint Mháithreachais 1994 agus 2004

source: • Employment Equality Acts 1998–2015
ga: • Na hAchtanna um Chomhionannas Fostaíochta 1998-2015

source: It is important for the agency worker to know who is responsible for ensuring compliance with employment protection legislation - the agency or the firm for which he or she is working
ga: Tá sé tábhachtach don oibrí gníomhaireachta fios a bheith aige/aici cé atá freagrach as a chinntiú go gcloítear le reachtaíocht cosanta fostaíochta - an ghníomhaireacht nó an gnólacht dá bhfuil sé/sí ag obair

source: Who is considered the employer of the agency worker?
ga: Cé a mheastar a bheith mar fhostóir ag an oibrí gníomhaireachta?

source: This depends on which rights the agency worker is seeking to enforce
ga: Braitheann sé seo ar na cearta atá an oibrí gníomhaireachta ag iarraidh a chur i bhfeidhm

source: Under the unfair dismissals legislation, the employer is the person for whom the employee actually works rather than the agency
ga: Faoin reachtaíocht dífhostú éagórach, is é an té dá n-oibríonn an duine, murab ionann agus an ghníomhaireacht, atá ina fhostóir

source: Compliance with health and safety requirements is also the responsibility of the person or organisation for whom the agency worker is actually working
ga: Is ar an duine nó ar an eagraíocht dá bhfuil an oibrí gníomhaireachta ag obair atá an fhreagracht cloí le riachtanais sláinte agus sábháilteachta

source: For the purposes of all other employment legislation, such as the Protection of Employees (Temporary Agency Work) Act 2012, the party liable to pay the wages of the employee (the employment agency or client company) will, normally, be considered to be the employer of the agency worker
ga: Chun cuspóirí gach reachtaíocht fostaíochta eile, cosúil leis an tAcht um Chosaint Fostaithe (Obair Ghníomhaireachta Shealadach) 2012, measfar an páirtí atá dlite chun pá an fhostaí a íoc (an ghníomhaireacht fostaíochta nó an cuideachta cliaint) a bheith mar fhostóir an oibrí gníomhaireachta go hiondúil

source: The Social Welfare (Miscellaneous Provisions) Act 2003 clarifies the social insurance position of agency workers
ga: Soiléiríonn an tAcht Leasa Shóisialaigh (Forálacha Ilghnéitheacha) 2003 seasamh na n-oibrithe gníomhaireachta ó thaobh árachais sóisialta de

source: It provides that agency workers are insurably employed and the person who pays the wages is the employer for PRSI purposes
ga: Déanann sé foráil go mbíonn fostaíocht inárachaithe ag oibrithe gníomhaireachtaí agus gur é an duine a íocann an tuarastal an fostóir chun cuspóirí ÁSPC

source: Under the Protection of Employees (Part-Time Work) Act 2001, a part-time agency worker can only compare himself or herself to a comparable full-time employee who is also an agency worker
ga: Faoin Acht um Chosaint Fostaithe (Obair Pháirtaimseartha) 2001, ní féidir le hoibrí gníomhaireachta páirtaimseartha é/í féin a chur i gcomparáid ach amháin le fostaí lánaimseartha inchomparáide

source: Legislation that does not apply to agency workers
ga: Reachtaíocht nach mbaineann le hoibrithe gníomhaireachta

source: The Protection of Employees (Fixed-Term Work) Act 2003 applies to most employees on fixed-term contracts
ga: Baineann an tAcht um Chosaint Fostaithe (Obair Téarma Shocraithe) 2003 le formhór fostaithe ar chonarthaí ar théarma seasta

source: It does not apply to agency workers placed by a temporary work agency to work under the supervision and direction of another organisation
ga: Ní bhaineann sé seo le hoibrithe gníomhaireachta, a chuirtear ag gníomhaireacht fostaíochta sealadach chun oibriú faoi mhaoirseacht agus faoi threoir eagraíochta eile

source: However, the Act does apply to agency workers employed directly by an employment agency
ga: Baineann an tAcht le hoibrithe gníomhaireachta a fhostaíonn gníomhaireacht fhostaíochta go díreach áfach

source: Employment agencies in Ireland are regulated by the Employment Agency Act 1971
ga: Tá gníomhaireachtaí fostaíochta in Éirinn á rialú ag an Acht um Ghníomhaireacht Fostaíochta 1971

source: Under the Act, an employment agency must have a licence to operate its business
ga: Faoin Acht, caithfidh gníomhaireachtaí fostaíochta ceadúnas a bheith acu chun feidhmiú in Éirinn

source: Details of the application procedure and a list of licensed employment agencies are available on the website of the Workplace Relations Commission
ga: Tá sonraí an nós imeachta iarratais agus liosta gníomhaireachtaí fostaíochta ceadaithe ar fáil ar shuíomh gréasáin an Choimisiúin um Chaidreamh san Áit Oibre

source: You can find out more about the rights of agency workers from Workplace Relations Commission's Information and Customer Service - see address below
ga: Tá faisnéis faoi chearta agus teidlíochtaí oibrithe gníomhaireachta ar fáil ón tSeirbhís Fhaisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre – féach seoladh thíos

source: If you are not getting your rights under the above legislation you may make a complaint using the online complaint form available on workplacerelations.ie. Workplace Relations Commission Information and Customer Service O'Brien Road Carlow R93 W7W2 Ireland Opening Hours: Mon. to Fri
ga: Mura bhfaigheann tú do chearta faoin reachtaíocht thuas, is féidir gearáin a dhéanamh tríd an fhoirm ghearáin ar líne a úsáid á fáil ar workplacerelations.ie
